КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Партнеры/КонтурЛогистика_Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_Партнеры</name>
  <attributes>
    <name>КодПартнераКонтур</name>
    <comment>Идентификатор партнера в сервисах ЭДО Контура</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭПДФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭПДТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭПДЭлПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Медик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОрганизацииДиадок</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
    <attributes>
      <name>ГО</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПВ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГП</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Диспетчер</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Медик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Техник</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>boxId</name>
      <comment>ящик диадок (на случай если роуминг или несколько провайдеров)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Настройки</name>
    <attributes>
      <name>Настройка</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_Настройки</types>
        <types>CatalogRef.КонтурЛогистика_НастройкиПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Обработчики</name>
    <attributes>
      <name>Событие</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СобытияОбработчиковПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстОбработкиПослеЗаполнения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПунктыМаршрута</name>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GLN</name>
      <comment>необязательно, (Global Location Number) — глобальный идентификационный номер. Он применяется для распознавания организаций, их частей и объектов: складов, магазинов, производств, автомобилей. GLN — международный код</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресИндекс</name>
      <comment>(варинат 2) Индекс - обязателен при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресКодРегион</name>
      <comment>(вариант 2) Код региона - обязателен при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресИнфКодСтраны</name>
      <comment>(вариант 1) Страна - обязательна при указании адреса простым текстом</comment>
      <type>
        <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресГород</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресНаселПункт</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресУлица</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресРайон</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресДом</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресКорпус</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресКварт</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отправление</name>
      <comment>Признак, что Может выступать в этой базе данных в качестве точки:отправления</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Прибытие</name>
      <comment>Признак, что Может выступать в этой базе данных в качестве точки:прибытия</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СобытияОбработчиковПартнеров/КонтурЛогистика_СобытияОбработчиковПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СобытияОбработчиковПартнеров</name>
  <enumValues>
    <name>ПослеЗаполненияТРНт1</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Партнеры/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПереформироватьДинСпискокТД();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПереформироватьДинСпискокТД();
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Процедура ПереформироватьДинСпискокТД()
	
	Если ЗначениеЗаполнено(Объект.КодПартнераКонтур) Тогда 
		СопоставленияПунктовМаршрута.Параметры.УстановитьЗначениеПараметра("ПартнерСсылка", Объект.Ссылка); 
		Элементы.СопоставленияПунктовМаршрута.Видимость = ЗначениеЗаполнено(Объект.Ссылка);
		Элементы.ПунктыМаршрута.Видимость = Не ЗначениеЗаполнено(Объект.Ссылка);
		Элементы.ГруппаНеЗаписан.Видимость = Не ЗначениеЗаполнено(Объект.Ссылка);
		Элементы.СопоставленияПунктовМаршрута.Обновить();
		Элементы.ГруппаПунктыМаршрута.Видимость = Истина;
	Иначе
		Элементы.ГруппаПунктыМаршрута.Видимость = Ложь;
		Элементы.ГруппаНеЗаписан.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОбновитьДинСписок(Параметр1, параметр2) Экспорт

	ПереформироватьДинСпискокТД();

КонецПроцедуры

&НаКлиенте
Процедура СопоставленияПунктовМаршрутаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда 
		
		ПараметрыФормы = Новый Структура;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда
			
			ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Ссылка);
			
		Иначе
			
			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("Наименование", ТекущиеДанные.Название);
			ДанныеЗаполнения.Вставить("Адрес", ТекущиеДанные.АдресСтрока);
			ДанныеЗаполнения.Вставить("GLN", ТекущиеДанные.GLN);
			ДанныеЗаполнения.Вставить("КПП", ТекущиеДанные.КПП);
			ДанныеЗаполнения.Вставить("АдресИндекс", ТекущиеДанные.АдресИндекс);
			ДанныеЗаполнения.Вставить("Партнер", Объект.Ссылка);
			ДанныеЗаполнения.Вставить("Прибытие", Истина);
			ДанныеЗаполнения.Вставить("АдресКодРегион", ТекущиеДанные.АдресКодРегион);
			ПараметрыФормы.Вставить("Основание", ДанныеЗаполнения); 
			
		КонецЕсли;
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_ПунктыМаршрута.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма, ЭтаФорма, "ОбработчикОбновитьДинСписок", ПараметрыФормы); 
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПунктыМаршрутаСервер(МассивСтруктурДанныеСтроки)
	
	Для Каждого СтруктураТочкиДоставки Из МассивСтруктурДанныеСтроки Цикл 
		
		НовыйПунктМаршрута = Справочники.КонтурЛогистика_ПунктыМаршрута.СоздатьЭлемент();
		НовыйПунктМаршрута.Заполнить(СтруктураТочкиДоставки);
		НовыйПунктМаршрута.Записать();
		
	КонецЦикла;
	
	ПереформироватьДинСпискокТД();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВыделенныеПунктыМаршрута(Команда)
	
	текВыделенныеСтроки = Элементы.СопоставленияПунктовМаршрута.ВыделенныеСтроки;

	МассивСтруктур = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из текВыделенныеСтроки Цикл
		
		ТекущиеДанные = Элементы.СопоставленияПунктовМаршрута.ДанныеСтроки(ВыделеннаяСтрока);
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда 
			
			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("Наименование", ТекущиеДанные.Название);
			ДанныеЗаполнения.Вставить("Адрес", ТекущиеДанные.АдресСтрока);
			ДанныеЗаполнения.Вставить("GLN", ТекущиеДанные.GLN);
			ДанныеЗаполнения.Вставить("КПП", ТекущиеДанные.КПП);
			ДанныеЗаполнения.Вставить("АдресИндекс", ТекущиеДанные.АдресИндекс);
			ДанныеЗаполнения.Вставить("Партнер", Объект.Ссылка);
			ДанныеЗаполнения.Вставить("Прибытие", Истина);
			ДанныеЗаполнения.Вставить("АдресКодРегион", ТекущиеДанные.АдресКодРегион);
			МассивСтруктур.Добавить(ДанныеЗаполнения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДобавитьПунктыМаршрутаСервер(МассивСтруктур);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиНастройкаПриИзменении(Элемент)
	
	// установить в значение дефолтное значение
	Если ЗначениеЗаполнено(Элементы.Настройки.ТекущиеДанные.Настройка) Тогда 
		Элементы.Настройки.ТекущиеДанные.Значение = 
			КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
				Элементы.Настройки.ТекущиеДанные.Настройка, "Значение");
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Не НоваяСтрока Или Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Условие) Тогда
		Элемент.ТекущиеДанные.Условие = "РезультатВычисления = Истина;";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикиТекстОбработкиПослеЗаполненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьРедактированиеТекстаОбработчика("ТекстОбработкиПослеЗаполнения");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикиУсловиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьРедактированиеТекстаОбработчика("Условие");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедактированиеТекстаОбработчика(ИмяРеквизита)
	
	ТекущиеДанные = Элементы.Обработчики.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Событие) Тогда
		КонтурЛогистика_СтдОбщегоНазначенияКлиент.СообщитьПользователюЛок(
			"Сначала выберите событие обработчика.");
		Возврат;
	КонецЕсли;
	
	ВыполнениеКода = ПараметрыВыполненияКодаПоСобытиюОбработчика(ТекущиеДанные.Событие);
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОткрытьФормуРедактированияТекста(
		ТекущиеДанные[ИмяРеквизита],
		Объект,
		ИмяРеквизита,
		Истина,
		Элементы.Обработчики,
		ВыполнениеКода,
		ТекстШаблоновПодсказокОбработчиковПартнера(ТекущиеДанные.Событие, ИмяРеквизита));
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыВыполненияКодаПоСобытиюОбработчика(Событие)
	
	ВыполнениеКода = Новый Структура;
	
	Если Событие = ПредопределенноеЗначение(
		"Перечисление.КонтурЛогистика_СобытияОбработчиковПартнеров.ПослеЗаполненияТРНт1") Тогда
		
		ВыполнениеКода.Вставить("Переменные", "Объект");
		ВыполнениеКода.Вставить("ДоступныРеквизитыТ1ЭТРН", Истина);
		
	Иначе
		
		ВыполнениеКода.Вставить("Переменные", "Объект");
		
	КонецЕсли;
	
	Возврат ВыполнениеКода;
	
КонецФункции

// Формирует текст подсказок и шаблонов для редактора кода обработчиков партнера.
//
// Параметры:
//  Событие - ПеречислениеСсылка.КонтурЛогистика_СобытияОбработчиковПартнеров
//  ИмяРеквизита - Строка - "Условие" или "ТекстОбработкиПослеЗаполнения"
//
// Возвращаемое значение:
//  Строка
//
&НаКлиенте
Функция ТекстШаблоновПодсказокОбработчиковПартнера(Событие, ИмяРеквизита)
	
	Возврат ТекстШаблоновПодсказокОбработчиковПартнераНаСервере(Событие, ИмяРеквизита);
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстШаблоновПодсказокОбработчиковПартнераНаСервере(Знач Событие, Знач ИмяРеквизита)
	
	Возврат Перечисления.КонтурЛогистика_СобытияОбработчиковПартнеров.ТекстШаблоновПодсказок(Событие, ИмяРеквизита);
	
КонецФункции
